---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFile.Write(Autodesk.Revit.DB.IFC.IFCFileWriteOptions)
source: html/8e477d3c-b0a9-8c8d-b613-a0b0e521437e.htm
---
# Autodesk.Revit.DB.IFC.IFCFile.Write Method

Writes content to a file of IFC format.

## Syntax (C#)
```csharp
public void Write(
	IFCFileWriteOptions writeOptions
)
```

## Parameters
- **writeOptions** (`Autodesk.Revit.DB.IFC.IFCFileWriteOptions`) - The IFC file write options.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null